performance_tasks.yml
config:
  target: "https://api.todoist.com"
  processor: "./dataGenerator.js"
  phases:
    - duration: 60
      arrivalRate: 50
      name: "Warm up load"
    - duration: 120
      arrivalRate: 10
      rampTo: 20
      name: "Ramp up load"
    - duration: 420
      arrivalRate: 50
      name: "Maximum load"
  defaults:
    headers:
      Authorization: Bearer {{ $processEnvironment.TOKEN }}
      Content-type: application/json
scenarios:
  - name: "Tasks lifecycle performance testing"
    flow:
      - function: createContent
      - get:
          url: "/rest/v1/tasks"
      - post:
          url: "/rest/v1/tasks"
          json:
            content: "{{ content }}"
            due_string: "{{ due_string }}"
            due_lang: "{{ due_lang }}"
            priority: "{{ priority }}"
          capture:
            json: "$.id"
            as: "id"
      - log: "New task id: {{ id }}"
      - get:
          url: "/rest/v1/tasks/{{ id }}"
      - post:
          url: "/rest/v1/tasks/{{ id }}"
          json:
            content: "{{ contentUpdated }}"
      - post:
          url: /rest/v1/tasks/{{ id }}/close
      - post:
          url: /rest/v1/tasks/{{ id }}/reopen
      - delete:
          url: "/rest/v1/tasks/{{ id }}"