performance_tasks.yml
config:
  target: "https://api.todoist.com"
  processor: "./dataGenerator.js"
  phases:
    - duration: 1
      arrivalRate: 1
      name: "Phase 1"
  defaults:
    headers:
      Authorization: Bearer {{ $processEnvironment.TOKEN }}
      Content-type: application/json
scenarios:
  - name: "Tasks lifecycle performance testing"
    flow:
      - function: createContent
      - get:
          url: "/rest/v1/tasks"
      - post:
          url: "/rest/v1/tasks"
          json:
            content: "{{ content }}"
            due_string: "{{ due_string }}"
            due_lang: "{{ due_lang }}"
            priority: "{{ priority }}"
          capture:
            json: "$.id"
            as: "id"
      - log: "New task id: {{ id }}"
      - get:
          url: "/rest/v1/tasks/{{ id }}"
      - post:
          url: "/rest/v1/tasks/{{ id }}"
          json:
            content: "{{ contentUpdated }}"
      - post:
          url: /rest/v1/tasks/{{ id }}/close
      - post:
          url: /rest/v1/tasks/{{ id }}/reopen
      ##- delete:
        ##  url: "/rest/v1/tasks/{{ id }}"